pants_data = {
    'Palac': [
        'palac.webp',
        'Брюки-палаццо из поливискозы с эластаном \nСостав: 54%Вис 44%ПЭ 2%ПУ; '
        '\nПОДКЛАДКА: 100%ПЭ \nЦвет: темно-синий Цена: 6199 руб.'
    ],
    'SlimFit': [
        'slimfit.webp',
        'Брюки Slim Fit из хлопка \nСостав: 98%Хлопок 2%Эластан; '
        '\nЦвет: черный Цена: 4999 руб.'
    ],
    'Classic': [
        'classic.webp',
        'Классические брюки из шерсти \nСостав: 70%Шерсть 30%ПЭ; '
        '\nЦвет: серый Цена: 7499 руб.'
    ]
}

footwear_data = {
    'LeatherBoots': [
        'leatherboots.webp',
        'Кожаные ботинки на шнуровке \nСостав: 100%Кожа; '
        '\nЦвет: черный Цена: 8999 руб.'
    ],
    'SportShoes': [
        'sports_shoes.webp',
        'Спортивные кроссовки с вентиляцией \nСостав: 60%Полиэстер 40%Резина; '
        '\nЦвет: белый с синими вставками Цена: 3499 руб.'
    ]
}

jacket_data = {
    'WinterJacket': [
        'winterjacket.webp',
        'Зимняя куртка с утеплителем \nСостав: 50%Полиэстер 50%ПЭ; '
        '\nЦвет: темно-синий Цена: 12999 руб.'
    ],
    'LeatherJacket': [
        'leatherjacket.webp',
        'Кожаная куртка с молнией \nСостав: 100%Кожа; '
        '\nЦвет: черный Цена: 15999 руб.'
    ]
}


